In [4]:
import pandas as pd
import matplotlib.pyplot as plt

Read the data into a dataframe:

In [5]:
titanic_dataset = pd.read_csv('./titanic.csv')
titanic_dataset

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

Summary of the dataframe:

In [6]:
titanic_dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

Check for unique values in each column:

In [28]:
print("--- No. of Unique Column Values ---")

titanic_dataset.nunique(dropna=True)

--- No. of Unique Column Values ---

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             89
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
dtype: int64

In [8]:
titanic_dataset['Survived'].value_counts()

Survived
0    549
1    342
Name: count, dtype: int64

In [9]:
titanic_dataset['Survived'] = titanic_dataset['Survived'].replace({
	0: 'No',
	1: 'Yes'
})
titanic_dataset.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,No,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,Yes,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,Yes,3,"Heikkinen, Miss Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,Yes,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,No,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [10]:
titanic_dataset['Pclass'].value_counts()

Pclass
3    491
1    216
2    184
Name: count, dtype: int64

In [11]:
titanic_dataset['Pclass'] = titanic_dataset['Pclass'].replace({
	3: 'Third',
	1: 'First',
	2: 'Second'
})
titanic_dataset.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,No,Third,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,Yes,First,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,Yes,Third,"Heikkinen, Miss Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,Yes,First,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,No,Third,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [12]:
titanic_dataset['Pclass'].value_counts()

Pclass
Third     491
First     216
Second    184
Name: count, dtype: int64

In [13]:
titanic_dataset['Sex'].value_counts()

Sex
male      577
female    314
Name: count, dtype: int64

In [14]:
titanic_dataset['Sex'] = titanic_dataset['Sex'].replace({
	'male': 'Male',
	'female': 'Female'
})
titanic_dataset.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,No,Third,"Braund, Mr. Owen Harris",Male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,Yes,First,"Cumings, Mrs. John Bradley (Florence Briggs Th...",Female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,Yes,Third,"Heikkinen, Miss Laina",Female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,Yes,First,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",Female,35.0,1,0,113803,53.1000,C123,S
4,5,No,Third,"Allen, Mr. William Henry",Male,35.0,0,0,373450,8.0500,NaN,S

In [15]:
titanic_dataset['Sex'].value_counts()

Sex
Male      577
Female    314
Name: count, dtype: int64

Convert data types:

In [21]:
data_types = {
	'Survived': 'category',
	'Pclass': 'category',
	'Sex': 'category',
	'Embarked': 'category',
}
titanic_dataset = titanic_dataset.astype(data_types)
titanic_dataset.dtypes

PassengerId       int64
Survived       category
Pclass         category
Name             object
Sex            category
Age             float64
SibSp             int64
Parch             int64
Ticket           object
Fare            float64
Cabin            object
Embarked       category
dtype: object

Examine the nature of age in the dataset:

In [16]:
titanic_dataset['Age'].value_counts()

Age
24.00    30
22.00    27
18.00    26
19.00    25
28.00    25
         ..
36.50     1
55.50     1
0.92      1
23.50     1
74.00     1
Name: count, Length: 88, dtype: int64

In [17]:
titanic_dataset['Age'].agg(['min', 'max', 'mean']).T

min      0.420000
max     80.000000
mean    29.699118
Name: Age, dtype: float64

Fill the missing values in the `titanic_dataset['Age']` column before `dtype` conversion with the mean value of the column.

In [29]:
titanic_dataset['Age'].fillna(
    titanic_dataset['Age'].mean(),
    inplace=True
)
titanic_dataset['Age'].info()

print("--- Filled missing values in the 'Age' column. ---")

<class 'pandas.core.series.Series'>
RangeIndex: 891 entries, 0 to 890
Series name: Age
Non-Null Count  Dtype
--------------  -----
891 non-null    float64
dtypes: float64(1)
memory usage: 7.1 KB
--- Filled missing values in the 'Age' column. ---

Convert the `float64` values in the age column to integers to ensure clean, discrete age data for modelling or analysis.

In [35]:
# Series.round() method rounds to the nearest whole number:
titanic_dataset['Age'] = titanic_dataset['Age'].round()

# Cast the column from float64 to int64, requires the values to be whole numbers:
titanic_dataset['Age'] = titanic_dataset['Age'].astype('int64')

print("--- DataFrame after rounding and conversion ---")
titanic_dataset.head()

--- DataFrame after rounding and conversion ---

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,No,Third,"Braund, Mr. Owen Harris",Male,22,1,0,A/5 21171,7.2500,NaN,S
1,2,Yes,First,"Cumings, Mrs. John Bradley (Florence Briggs Th...",Female,38,1,0,PC 17599,71.2833,C85,C
2,3,Yes,Third,"Heikkinen, Miss Laina",Female,26,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,Yes,First,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",Female,35,1,0,113803,53.1000,C123,S
4,5,No,Third,"Allen, Mr. William Henry",Male,35,0,0,373450,8.0500,NaN,S

In [36]:
print("--- Dtypes after rounding and conversion ---")
titanic_dataset.dtypes

--- Dtypes after rounding and conversion ---

PassengerId       int64
Survived       category
Pclass         category
Name             object
Sex            category
Age               int64
SibSp             int64
Parch             int64
Ticket           object
Fare            float64
Cabin            object
Embarked       category
dtype: object

The `titanic_dataset['Cabin']` column had a significant number of null values i.e. *77%* of the total number of values were null.

This is further explored below in an attempt to figure out why:

In [49]:
print("--- DataFrame showing entries with null values in the 'Cabin' column ---")
titanic_dataset.loc[titanic_dataset['Cabin'].isna() == True]

--- DataFrame showing entries with null values in the 'Cabin' column ---

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,No,Third,"Braund, Mr. Owen Harris",Male,22,1,0,A/5 21171,7.2500,NaN,S
2,3,Yes,Third,"Heikkinen, Miss Laina",Female,26,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,No,Third,"Allen, Mr. William Henry",Male,35,0,0,373450,8.0500,NaN,S
5,6,No,Third,"Moran, Mr. James",Male,30,0,0,330877,8.4583,NaN,Q
7,8,No,Third,"Palsson, Master Gosta Leonard",Male,2,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
884,885,No,Third,"Sutehall, Mr. Henry Jr",Male,25,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,No,Third,"Rice, Mrs. William (Margaret Norton)",Female,39,0,5,382652,29.1250,NaN,Q
886,887,No,Second,"Montvila, Rev. Juozas",Male,27,0,0,211536,13.0000,NaN,S
888,889,No,Third,"Johnston, Miss Catherine Helen ""Carrie""",Female,30,1,2,W./C. 6607,23.4500,NaN,S
890,891,No,Third,"Dooley, Mr. Patrick",Male,32,0,0,370376,7.7500,NaN,Q

In [55]:
titanic_dataset[['Cabin', 'Pclass']]

    Cabin  Pclass
0     NaN   Third
1     C85   First
2     NaN   Third
3    C123   First
4     NaN   Third
..    ...     ...
886   NaN  Second
887   B42   First
888   NaN   Third
889  C148   First
890   NaN   Third

[891 rows x 2 columns]

- First Class cabins:

In [89]:
first_class_cabins_null = titanic_dataset.loc[
    (titanic_dataset['Cabin'].isna()) & (titanic_dataset['Pclass'] == 'First')
    ]
first_class_cabins_null.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
30,31,No,First,"Uruchurtu, Don. Manuel E",Male,40,0,0,PC 17601,27.7208,NaN,C
34,35,No,First,"Meyer, Mr. Edgar Joseph",Male,28,1,0,PC 17604,82.1708,NaN,C
35,36,No,First,"Holverson, Mr. Alexander Oskar",Male,42,1,0,113789,52.0000,NaN,S
64,65,No,First,"Stewart, Mr. Albert A",Male,30,0,0,PC 17605,27.7208,NaN,C
83,84,No,First,"Carrau, Mr. Francisco M",Male,28,0,0,113059,47.1000,NaN,S

In [111]:
print("--- Proportion of null values to non-null 'Cabin' values in First Class: ---")

first_class = titanic_dataset.loc[titanic_dataset['Pclass'] == 'First']

print(
    f"Total entries in First Class: {first_class.shape[0]}",
    f"\nTotal no. of null Cabin values in First Class: {first_class_cabins_null.shape[0]}",
    f"\nProportion: {(((first_class_cabins_null.shape[0]) / (first_class.shape[0])) * 100):.2f}%"
)

--- Proportion of null values to non-null 'Cabin' values in First Class: ---
Total entries in First Class: 216
Total no. of null Cabin values in First Class: 40
Proportion: 18.52%

- Second Class cabins:

In [107]:
second_class_cabins_null = titanic_dataset.loc[
    (titanic_dataset['Cabin'].isna()) & (titanic_dataset['Pclass'] == 'Second')
]
second_class_cabins_null

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
9,10,Yes,Second,"Nasser, Mrs. Nicholas (Adele Achem)",Female,14,1,0,237736,30.0708,NaN,C
15,16,Yes,Second,"Hewlett, Mrs. (Mary D Kingcome)",Female,55,0,0,248706,16.0000,NaN,S
17,18,Yes,Second,"Williams, Mr. Charles Eugene",Male,30,0,0,244373,13.0000,NaN,S
20,21,No,Second,"Fynney, Mr. Joseph J",Male,35,0,0,239865,26.0000,NaN,S
33,34,No,Second,"Wheadon, Mr. Edward H",Male,66,0,0,C.A. 24579,10.5000,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
866,867,Yes,Second,"Duran y More, Miss Asuncion",Female,27,1,0,SC/PARIS 2149,13.8583,NaN,C
874,875,Yes,Second,"Abelson, Mrs. Samuel (Hannah Wizosky)",Female,28,1,0,P/PP 3381,24.0000,NaN,C
880,881,Yes,Second,"Shelley, Mrs. William (Imanita Parrish Hall)",Female,25,0,1,230433,26.0000,NaN,S
883,884,No,Second,"Banfield, Mr. Frederick James",Male,28,0,0,C.A./SOTON 34068,10.5000,NaN,S
886,887,No,Second,"Montvila, Rev. Juozas",Male,27,0,0,211536,13.0000,NaN,S

In [110]:
print("--- Proportion of null values to non-null 'Cabin' values in Second Class: ---")

second_class = titanic_dataset.loc[titanic_dataset['Pclass'] == 'Second']

print(
    f"Total entries in Second Class: {second_class.shape[0]}",
    f"\nTotal no. of null Cabin values in Second Class: {second_class_cabins_null.shape[0]}",
    f"\nProportion: {(((second_class_cabins_null.shape[0]) / (second_class.shape[0])) * 100):.2f} %"
)

--- Proportion of null values to non-null 'Cabin' values in Second Class: ---
Total entries in Second Class: 184
Total no. of null Cabin values in Second Class: 168
Proportion: 91.30 %

- Third Class cabins:

In [99]:
third_class_cabins_null = titanic_dataset.loc[
    (titanic_dataset['Cabin'].isna()) & (titanic_dataset['Pclass'] == 'Third')
]
third_class_cabins_null

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,No,Third,"Braund, Mr. Owen Harris",Male,22,1,0,A/5 21171,7.2500,NaN,S
2,3,Yes,Third,"Heikkinen, Miss Laina",Female,26,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,No,Third,"Allen, Mr. William Henry",Male,35,0,0,373450,8.0500,NaN,S
5,6,No,Third,"Moran, Mr. James",Male,30,0,0,330877,8.4583,NaN,Q
7,8,No,Third,"Palsson, Master Gosta Leonard",Male,2,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
882,883,No,Third,"Dahlberg, Miss Gerda Ulrika",Female,22,0,0,7552,10.5167,NaN,S
884,885,No,Third,"Sutehall, Mr. Henry Jr",Male,25,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,No,Third,"Rice, Mrs. William (Margaret Norton)",Female,39,0,5,382652,29.1250,NaN,Q
888,889,No,Third,"Johnston, Miss Catherine Helen ""Carrie""",Female,30,1,2,W./C. 6607,23.4500,NaN,S
890,891,No,Third,"Dooley, Mr. Patrick",Male,32,0,0,370376,7.7500,NaN,Q

In [113]:
print("--- Proportion of null values to non-null 'Cabin' values in Third Class: ---")

third_class = titanic_dataset.loc[titanic_dataset['Pclass'] == 'Third']

print(
    f"Total entries in Third Class: {third_class.shape[0]}",
    f"\nTotal no. of Null Cabin values in Third Class: {third_class_cabins_null.shape[0]}",
    f"\nProportion: {(((third_class_cabins_null.shape[0]) / (third_class.shape[0])) * 100):.2f}%"
)

--- Proportion of null values to non-null 'Cabin' values in Third Class: ---
Total entries in Third Class: 491
Total no. of Null Cabin values in Third Class: 479
Proportion: 97.56%

- Second and Third `['Pclass]` have a high proportion of null values in `['Cabin']`. View the non-null values in each `['Pclass']`:

In [114]:
print("--- Non-null entries in Second Class ---")

titanic_dataset.loc[
    (titanic_dataset['Cabin'].isna() == False) & (titanic_dataset['Pclass'] == 'Second')
]

--- Non-null entries in Second Class ---

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
21,22,Yes,Second,"Beesley, Mr. Lawrence",Male,34,0,0,248698,13.0000,D56,S
66,67,Yes,Second,"Nye, Mrs. (Elizabeth Ramell)",Female,29,0,0,C.A. 29395,10.5000,F33,S
123,124,Yes,Second,"Webber, Miss Susan",Female,32,0,0,27267,13.0000,E101,S
148,149,No,Second,"Navratil, Mr. Michel (""Louis M Hoffman"")",Male,36,0,2,230080,26.0000,F2,S
183,184,Yes,Second,"Becker, Master Richard F",Male,1,2,1,230136,39.0000,F4,S
193,194,Yes,Second,"Navratil, Master Michel M",Male,3,1,1,230080,26.0000,F2,S
292,293,No,Second,"Levy, Mr. Rene Jacques",Male,36,0,0,SC/Paris 2163,12.8750,D,C
303,304,Yes,Second,"Keane, Miss Nora A",Female,30,0,0,226593,12.3500,E101,Q
327,328,Yes,Second,"Ball, Mrs. (Ada E Hall)",Female,36,0,0,28551,13.0000,D,S
340,341,Yes,Second,"Navratil, Master Edmond Roger",Male,2,1,1,230080,26.0000,F2,S
345,346,Yes,Second,"Brown, Miss Amelia ""Mildred""",Female,24,0,0,248733,13.0000,F33,S
473,474,Yes,Second,"Jerwan, Mrs. Amin S (Marie Marthe Thuillard)",Female,23,0,0,SC/AH Basle 541,13.7917,D,C
516,517,Yes,Second,"Lemore, Mrs. (Amelia Milley)",Female,34,0,0,C.A. 34260,10.5000,F33,S
618,619,Yes,Second,"Becker, Miss Marion Louise",Female,4,2,1,230136,39.0000,F4,S
717,718,Yes,Second,"Troutt, Miss Edwina Celia ""Winnie""",Female,27,0,0,34218,10.5000,E101,S
772,773,No,Second,"Mack, Mrs. (Mary)",Female,57,0,0,S.O./P.P. 3,10.5000,E77,S

In [115]:
print("--- Non-null entries in Third Class ---")

titanic_dataset.loc[
    (titanic_dataset['Cabin'].isna() == False) & (titanic_dataset['Pclass'] == 'Third')
]

--- Non-null entries in Third Class ---

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
10,11,Yes,Third,"Sandstrom, Miss Marguerite Rut",Female,4,1,1,PP 9549,16.7000,G6,S
75,76,No,Third,"Moen, Mr. Sigurd Hansen",Male,25,0,0,348123,7.6500,F G73,S
128,129,Yes,Third,"Peter, Miss Anna",Female,30,1,1,2668,22.3583,F E69,C
205,206,No,Third,"Strom, Miss Telma Matilda",Female,2,0,1,347054,10.4625,G6,S
251,252,No,Third,"Strom, Mrs. Wilhelm (Elna Matilda Persson)",Female,29,1,1,347054,10.4625,G6,S
394,395,Yes,Third,"Sandstrom, Mrs. Hjalmar (Agnes Charlotta Bengt...",Female,24,0,2,PP 9549,16.7000,G6,S
429,430,Yes,Third,"Pickard, Mr. Berk (Berk Trembisky)",Male,32,0,0,SOTON/O.Q. 392078,8.0500,E10,S
699,700,No,Third,"Humblen, Mr. Adolf Mathias Nicolai Olsen",Male,42,0,0,348121,7.6500,F G63,S
715,716,No,Third,"Soholt, Mr. Peter Andreas Lauritz Andersen",Male,19,0,0,348124,7.6500,F G73,S
751,752,Yes,Third,"Moor, Master Meier",Male,6,0,1,392096,12.4750,E121,S
776,777,No,Third,"Tobin, Mr. Roger",Male,30,0,0,383121,7.7500,F38,Q
823,824,Yes,Third,"Moor, Mrs. (Beila)",Female,27,0,1,392096,12.4750,E121,S

Check for duplicates in each column:

In [ ]:
titanic_dataset.duplicated().value_counts()

Check for missing values:

In [ ]:
titanic_dataset.isna().sum()

View the missing values in the `titanic_dataset['Embarked']` column:

In [ ]:
titanic_dataset.loc[titanic_dataset['Embarked'].isna() == True]

It appears the passengers never embarked on the ship, therefore we drop their respective entries as they won't be relevant to the main target variable i.e. Survival.

In [ ]:
titanic_dataset.dropna(subset=['Embarked'], inplace=True)
titanic_dataset.info()

View the missing values in the `titanic_dataset['Age']` column:

In [ ]:
titanic_dataset.loc[titanic_dataset['Age'].isna() == True]

In [ ]:
titanic_dataset['Age'].value_counts()